pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write these bits as 0b110</description>		
				<bitRange>[14:12]</bitRange>		
					
			</field>			
			<field>			
				<name>ACMP</name>		
				<description>Analog comparator power down</description>		
				<bitRange>[15:15]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:16]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>DEVICE_ID</name>				
		<description>Device ID</description>				
		<addressOffset>0x3F4</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0x00000000</resetMask>				
		<fields>				
			<field>			
				<name>DEVICEID</name>		
				<description>TBD</description>		
				<bitRange>[31:0]</bitRange>		
			</field>			
		</fields>				
	</register>					
</registers>						
										

		</peripheral>
		<peripheral>
	<name>I2C</name>
	<description>I2C-bus interface</description>
	<groupName>I2C</groupName>
	<baseAddress>0x40050000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>I2C</name>
	<value>8</value>
	</interrupt>
	<registers>
		<register>
			<name>CFG</name>
			<description>Configuration for shared functions.</description>
			<addressOffset>0x00</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTEN</name>
					<description>Master Enable. When disabled, configurations settings for the Master function are not changed, but the Master function is internally reset.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_I2C_MA</name>
							<description>Disabled. The I2C Master function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_I2C_MAS</name>
							<description>Enabled. The I2C Master function is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVEN</name>
					<description>Slave Enable. When disabled, configurations settings for the Slave function are not changed, but the Slave function is internally reset.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_I2C_SL</name>
							<description>Disabled. The I2C slave function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_I2C_SLA</name>
							<description>Enabled. The I2C slave function is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONEN</name>
					<description>Monitor Enable. When disabled, configurations settings for the Monitor function are not changed, but the Monitor function is internally reset.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_I2C_MO</name>
							<description>Disabled. The I2C monitor function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_I2C_MON</name>
							<description>Enabled. The I2C monitor function is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TIMEOUTEN</name>
					<description>I2C bus Time-out Enable. When disabled, timeout flags will be automatically cleared.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_TIME_OUT_F</name>
							<description>Disabled. Time-out function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_TIME_OUT_FU</name>
							<description>Enabled. Time-out function is enabled. Both types of time-out flags will be generated and will cause interrupts if they are enabled. Typically, only one timeout will be used in a system.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONCLKSTR</name>
					<description>Monitor function Clock Stretching.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_MONITO</name>
							<description>Disabled. The monitor function will not perform clock stretching. Software may not always be able to read data provided by the monitor function before it is overwritten. This mode may be used when non-invasive monitoring is critical.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_MONITOR</name>
							<description>Enabled. The monitor function will perform clock stretching in order to ensure that software can read all incoming data supplied by the monitor function.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
					
