pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
				</field>
			</fields>
		</register>
		<register>
			<name>STAT</name>
			<description>Status register for Master, Slave, and Monitor functions.</description>
			<addressOffset>0x04</addressOffset>
			<access>read-write</access>
			<resetValue>0x000801</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTPENDING</name>
					<description>Master Pending. Indicates whether the Master function needs software service. This flag will cause an interrupt when set if enabled via the INTENSET register.  The MSTPENDING flag is automatically cleared when a 1 is written to the MSTCONTINUE bit in the MSTCTL register.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_SERVICE_NEEDED_T</name>
							<description>No service needed. The Master function does not currently need service.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SERVICE_NEEDED_THE_</name>
							<description>Service needed. The Master function needs service. Information on what is needed can be found in the adjacent MSTSTATE field.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSTSTATE</name>
					<description>Master State code. Each value of this field indicates a specific required service for the Master function.  All other values are reserved.</description>
					<bitRange>[3:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IDLE_THE_MASTER_FUN</name>
							<description>Idle. The Master function is available to be used for a new transaction.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RECEIVE_READY_RECEI</name>
							<description>Receive ready. Received data  available (Master Receiver mode). Address plus Read was previously sent and Acknowledged by slave.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSMIT_READY_DATA</name>
							<description>Transmit ready. Data can be transmitted (Master Transmitter mode). Address plus Write was previously sent and Acknowledged by slave.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADDRESS_SLAVE_NACKE</name>
							<description>Address. Slave Nacked address.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_SLAVE_NACKED_T</name>
							<description>Data. Slave Nacked transmitted data.</description>
							<value>0x4</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSTARBLOSS</name>
					<description>Master Arbitration Loss flag. This flag can be cleared by software writing a 1 to this bit. It is also cleared automatically a 1 is written to MSTCONTINUE.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_LOSS_NO_ARBITRAT</name>
							<description>No loss. No Arbitration Loss has occurred.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ARBITRATION_LOSS_TH</name>
							<description>Arbitration loss. The Master function has experienced an Arbitration Loss. At this point, the Master function has already stopped driving the bus and gone to an idle state. Software can respond by doing nothing, or by sending a Start in order to attempt to gain control of the bus when it next becomes idle.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:5]</bitRange>
					
				</field>
				<field>
					<name>MSTSTSTPERR</name>
					<description>Master Start/Stop Error flag. This flag can be cleared by software writing a 1 to this bit. It is also cleared automatically a 1 is written to MstContinue.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_STARTSTOP_ERROR_</name>
							<description>No Start/Stop Error has occurred.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STARTSTOP_ERROR_HAS</name>
							<description>Start/stop error has occurred. The Master function has experienced a Start/Stop Error. A Start or Stop was detected at a time when it is not allowed by the I2C specification. The Master interface has stopped driving the bus and gone to an idle state, no action is required. A request for a Start could be made, or software could attempt to insure that the bus has not stalled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
					
				</field>
				<field>
					<name>SLVPENDING</name>
					<description>Slave Pending. Indicates whether the Slave function needs software service. This flag will cause an interrupt when set if enabled via INTENSET.  The SLVPENDING flag is read-only and is automatically cleared when a 1 is written to the SLVCONTINUE bit in the MSTCTL register.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_SERVICE_NEEDED_T</name>
							<description>No service needed. The Slave function does not currently need service.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SERVICE_NEEDED_THE_</name>
							<description>Service needed. The Slave function needs service. Information on what is needed can be found in the adjacent SLVSTATE field.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVSTATE</name>
					<description>Slave State code. Each value of this field indicates a specific required service for the Slave function. All other values are reserved.</description>
					<bitRange>[10:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RECEIVED_ADDRESS_PL</name>
							<description>Received. Address plus R/W received. At least one of the four slave addresses has been matched by hardware.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_AVAILABLE_RECE</name>
							<description>Data available. Received data is available (Slave Receiver mode).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_READY_FOR_TRANS</name>
							<description>Data ready for transmit. Data can be transmitted (Slave Transmitter mode).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVNOTSTR</name>
					<description>Slave Not Stretching. Indicates when the slave function is stretching the I2C clock. This is needed in order to gracefully invoke Deep Sleep or Power-down modes during slave operation. This read-only flag reflects the slave function status in real time.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STRETCHING_THE_SLAV</name>
							<description>Stretching. The slave function is currently stretching the I2C bus clock. Deep-Sleep or Power-down mode cannot be entered at this time.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NOT_STRETCHING_THE_</name>
							<description>Not stretching. The slave function is not currently stretching the I 2C bus clock. Deep-sleep or Power-down mode could be entered at this time.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVIDX</name>
					<description>Slave address match Index. This field is valid when the I2C slave function has been selected by receiving an address that matches one of the slave addresses defined by any enabled slave address registers, and provides an identification of the address that was matched. It is possible that more than one address could be matched, but only one match can be reported here.</description>
					<bitRange>[13:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SLAVE_ADDRESS_0_WAS_</name>
							<description>Slave address 0 was matched.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLAVE_ADDRESS_1_WAS_</name>
							<description>Slave address 1 was matched.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLAVE_ADDRESS_2_WAS_</name>
							<description>Slave address 2 was matched.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLAVE_ADDRESS_3_WAS_</name>
							<description>Slave address 3 was matched.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVSEL</name>
					<description>Slave selected flag. SLVSEL is set after an address match when software tells the Slave function to acknowledge the address. It is cleared when another address cycle presents an address that does not match an enabled address on the Slave function, when slave software decides to Nack a matched address, or when there is a Stop detected on the bus. SLVSEL is not cleared if software Nacks data.</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_SELECTED_THE_SL</name>
							<description>Not selected. The Slave function is not currently selected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTED_THE_SLAVE_</name>
							<description>Selected. The Slave function is currently selected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVDESEL</name>
					<description>Slave Deselected flag. This flag will cause an interrupt when set if enabled via INTENSET. This flag can be cleared by writing a 1 to this bit.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_DESELECTED_THE_</name>
							<description>Not deselected. The Slave function has not become deselected. This does not mean that it is currently selected. That information can be found in the SLVSEL flag.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DESELECTED_THE_SLAV</name>
							<description>Deselected. The Slave function has become deselected. This is specifically caused by the SLVSEL flag changing from 1 to 0. See the description of SLVSEL for details on when that event occurs.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONRDY</name>
					<description>Monitor Ready. This flag is cleared when the MONRXDAT register is read.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_DATA_THE_MONITOR</name>
							<description>No data. The Monitor function does not currently have data available.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_WAITING_THE_MO</name>
							<description>Data waiting. The Monitor function has data waiting to be read.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONOV</name>
					<description>Monitor Overflow flag.</description>
					<bitRange>[17:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_OVERRUN_MONITOR_</name>
							<description>No overrun. Monitor data has not overrun.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OVERRUN_A_MONITOR_D</name>
							<description>Overrun. A Monitor data overrun has occurred. This can only happen when Monitor clock stretching not enabled via the MONCLKSTR bit in the CFG register. Writing 1 to this bit clears the flag.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONACTIVE</name>
					<description>Monitor Active flag. This flag indicates when the Monitor function considers the I2C bus to be active. Active is defined here as when some Master is on the bus: a bus Start has occurred more recently than a bus Stop.</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_THE_MONITO</name>
							<description>Inactive. The Monitor function considers the I2C bus to be inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE_THE_MONITOR_</name>
							<description>Active. The Monitor function considers the I2C bus to be active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONIDLE</name>
					<description>Monitor Idle flag. This flag is set when the Monitor function sees the I2C bus change from active to inactive. This can be used by software to decide when to process data accumulated by the Monitor function. This flag will cause an interrupt when set if enabled via the INTENSET register . The flag can be cleared by writing a 1 to this bit.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_IDLE_THE_I2C_BU</name>
							<description>Not idle. The I2C bus is not idle, or this flag has been cleared by software.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IDLE_THE_I2C_BUS_HA</name>
							<description>Idle. The I2C bus has gone idle at least once since the last time this flag was cleared by software.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:20]</bitRange>
					
