pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
				</field>
				<field>
					<name>EVENTTIMEOUT</name>
					<description>Event Time-out Interrupt flag. Indicates when the time between events has been longer than the time specified by the TIMEOUT register. Events include Start, Stop, and clock edges. The case of SCL remaining low longer than TIMEOUT is not reported by this flag, it is reported in by the SCL Time-out flag. The flag is cleared by writing a 1 to this bit.</description>
					<bitRange>[24:24]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_TIME_OUT_I2C_BUS</name>
							<description>No time-out. I2C bus events have not caused a timeout.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EVENT_TIME_OUT_THE_</name>
							<description>Event time-out. The time between I2C bus events has been longer than the time specified by the I2C Timeout register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCLTIMEOUT</name>
					<description>SCL Time-out Interrupt flag. Indicates when SCL has remained low longer than the time specific by the TIMEOUT register. The flag is cleared by writing a 1 to this bit.</description>
					<bitRange>[25:25]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_TIME_OUT_SCL_LOW</name>
							<description>No time-out. SCL low time has not caused a timeout.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TIME_OUT_SCL_LOW_TI</name>
							<description>Time-out. SCL low time has caused a timeout.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:26]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>INTENSET</name>
			<description>Interrupt Enable Set and read register.</description>
			<addressOffset>0x08</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTPENDINGEN</name>
					<description>Master Pending interrupt Enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_MSTPENDING_INTER</name>
							<description>The MstPending interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_MSTPENDING_INTER</name>
							<description>The MstPending interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[3:1]</bitRange>
					
				</field>
				<field>
					<name>MSTARBLOSSEN</name>
					<description>Master Arbitration Loss interrupt Enable.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_MSTARBLOSS_INTER</name>
							<description>The MstArbLoss interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_MSTARBLOSS_INTER</name>
							<description>The MstArbLoss interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:5]</bitRange>
					
				</field>
				<field>
					<name>MSTSTSTPERREN</name>
					<description>Master Start/Stop Error interrupt Enable.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_MSTSTSTPERR_INTE</name>
							<description>The MstStStpErr interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_MSTSTSTPERR_INTE</name>
							<description>The MstStStpErr interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
					
				</field>
				<field>
					<name>SLVPENDINGEN</name>
					<description>Slave Pending interrupt Enable.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SLVPENDING_INTER</name>
							<description>The SlvPending interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SLVPENDING_INTER</name>
							<description>The SlvPending interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[10:9]</bitRange>
					
				</field>
				<field>
					<name>SLVNOTSTREN</name>
					<description>Slave Not Stretching interrupt Enable.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SLVNOTSTR_INTERR</name>
							<description>The SlvNotStr interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SLVNOTSTR_INTERR</name>
							<description>The SlvNotStr interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[14:12]</bitRange>
					
