pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
				</field>
			</fields>
		</register>
	</registers>
		</peripheral>
		<peripheral>
	<name>SPI0</name>
	<description>SPI</description>
	<groupName>SPI</groupName>
	<baseAddress>0x40058000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SPI0</name>
	<value>0</value>
	</interrupt>
	<registers>
		<register>
			<name>CFG</name>
			<description>SPI Configuration register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>Enable</name>
					<description>SPI enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_SPI_IS</name>
							<description>Disabled. The SPI is disabled and the internal state machine and counters are reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_SPI_IS_</name>
							<description>Enabled. The SPI is enabled for operation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[1:1]</bitRange>
			
				</field>
				<field>
					<name>Master</name>
					<description>Master mode select.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SLAVE_MODE_THE_SPI_</name>
							<description>Slave mode. The SPI will operate in slave mode. SCK, MOSI, and the SSEL signals are inputs, MISO is an output.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MASTER_MODE_THE_SPI</name>
							<description>Master mode. The SPI will operate in master mode. SCK, MOSI, and the SSEL signals are outputs, MISO is an input.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LSBF</name>
					<description>LSB First mode enable.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>STANDARD_DATA_IS_TR</name>
							<description>Standard. Data is transmitted and received in standard MSB first order.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REVERSE_DATA_IS_TRA</name>
							<description>Reverse. Data is transmitted and received in reverse order (LSB first).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CPHA</name>
					<description>Clock Phase select. .</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CHANGE_THE_SPI_CAPT</name>
							<description>Change. The SPI captures serial data on the first clock transition of the frame (when the clock changes away from the rest state). Data is changed on the following edge.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CAPTURE_THE_SPI_CHA</name>
							<description>Capture. The SPI changes serial data on the first clock transition of the frame (when the clock changes away from the rest state). Data is captured on the following edge.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CPOL</name>
					<description>Clock Polarity select.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW_THE_REST_STATE_</name>
							<description>Low. The rest state of the clock (between frames) is low.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_THE_REST_STATE</name>
							<description>High. The rest state of the clock (between frames) is high.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[6:6]</bitRange>
			
				</field>
				<field>
					<name>Loop</name>
					<description>Loopback mode enable. Loopback mode applies only to Master mode, and connects transmit and receive data connected together to allow simple software testing.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SPOL</name>
					<description>SSEL Polarity select.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW_THE_SSEL_PIN_IS</name>
							<description>Low. The SSEL pin is active low. The value in the SSEL fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL is not inverted relative to the pins.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH_THE_SSEL_PIN_I</name>
							<description>High. The SSEL pin is active high. The value in the SSEL fields of the RXDAT, TXDATCTL, and TXCTL registers related to SSEL is inverted relative to the pins.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:9]</bitRange>
			
