pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
				</field>
			</fields>
		</register>
		<register>
			<name>DLY</name>
			<description>SPI Delay register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PRE_DELAY</name>
					<description>Controls the amount of time between SSEL assertion and the beginning of a data frame.  There is always one SPI clock time between SSEL assertion and the first clock edge. This is not considered part of the pre-delay. 0x0 = No additional time is inserted. 0x1 = 1 SPI clock time is inserted. 0x2 = 2 SPI clock times are inserted. ... 0xF = 15 SPI clock times are inserted.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>POST_DELAY</name>
					<description>Controls the amount of time between the end of a data frame and SSEL deassertion.  0x0 = No additional time is inserted. 0x1 = 1 SPI clock time is inserted. 0x2 = 2 SPI clock times are inserted. ... 0xF = 15 SPI clock times are inserted.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>FRAME_DELAY</name>
					<description>Controls the minimum amount of time between adjacent data frames.  0x0 = No additional time is inserted. 0x1 = 1 SPI clock time is inserted. 0x2 = 2 SPI clock times are inserted. ... 0xF = 15 SPI clock times are inserted.</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>TRANSFER_DELAY</name>
					<description>Controls the minimum amount of time that the SSELs are deasserted between transfers.  0x0 = The minimum time that SSEL is deasserted is 1 SPI clock time. (Zero added time.) 0x1 = The minimum time that SSEL is deasserted is 2 SPI clock times. 0x2 = The minimum time that SSEL is deasserted is 3 SPI clock times. ... 0xF = The minimum time that SSEL is deasserted is 16 SPI clock times.</description>
					<bitRange>[15:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STAT</name>
			<description>SPI Status. Some status flags can be cleared by writing a 1 to that bit position</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x0102</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXRDY</name>
					<description>Receiver Ready flag. When 1, indicates that data is available to be read from the receiver buffer. Cleared after a read of the RXDAT register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXRDY</name>
					<description>Transmitter Ready flag. When 1, this bit indicates that data may be written to the transmit buffer. Previous data may still be in the process of being transmitted. Cleared when data is written to TXDAT or TXDATCTL until the data is moved to the transmit shift register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXOV</name>
					<description>Receiver Overrun interrupt flag. This flag is set when the beginning of a received character is detected while the receiver buffer is still in use. If this occurs, the receiver buffer contents are preserved, and the incoming data is lost. Data received by the SPI should be considered undefined if RxOv is set.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TXUR</name>
					<description>Transmitter Underrun interrupt flag. This flag applies only to slave mode (Master = 0). In this case, the transmitter must begin sending new data on the next input clock if the transmitter is idle. If that data is not available in the transmitter holding register at that point, there is no data to transmit and the TxUr flag is set. Data transmitted by the SPI should be considered undefined if TxUr is set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SSA</name>
					<description>Slave Select Assert. This flag is set whenever any slave select transitions from deasserted to asserted, in both master and slave modes. This allows determining when the SPI transmit/receive functions become busy, and allows waking up the device from reduced power modes when a slave mode access begins. This flag is cleared by software.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SSD</name>
					<description>Slave Select Deassert. This flag is set whenever any asserted slave selects transition to deasserted, in both master and slave modes. This allows determining when the SPI transmit/receive functions become idle. This flag is cleared by software.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>STALLED</name>
					<description>Stalled status flag. This indicates whether the SPI is currently in a stall condition.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENDTRANSFER</name>
					<description>End Transfer control bit. Software can set this bit to force an end to the current transfer when the transmitter finishes any activity already in progress, as if the EOT flag had been set prior to the last transmission. This capability is included to support cases where it is not known when transmit data is written that it will be the end of a transfer. The bit is cleared when the transmitter becomes Idle as the transfer comes to an end. Forcing an end of transfer in this manner causes any specified FrameDelay and TransferDelay to be inserted.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>IDLE</name>
					<description>Idle status flag. This bit is 1 whenever the SPI master function is fully idle. This means that the transmit holding register is empty and the transmitter is not in the process of sending data.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTENSET</name>
			<description>SPI Interrupt Enable read and Set. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXRDYEN</name>
					<description>Determines whether an interrupt occurs when receiver data is available.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when receiver data is available.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when receiver data is available in the RXDAT register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXRDYEN</name>
					<description>Determines whether an interrupt occurs when the transmitter holding register is available.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when the transmitter holding register is available.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when data may be written to TXDAT.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXOVEN</name>
					<description>Determines whether an interrupt occurs when a receiver overrun occurs. This happens in slave mode when there is a need for the receiver to move newly received data to the RXDAT register when it is already in use. The interface prevents receiver overrun in Master mode by not allowing a new transmission to begin when a receiver overrun would otherwise occur.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when a receiver overrun occurs.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated if a receiver overrun occurs.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXUREN</name>
					<description>Determines whether an interrupt occurs when a transmitter underrun occurs. This happens in slave mode when there is a need to transmit data when none is available.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when the transmitter underruns.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated if the transmitter underruns.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SSAEN</name>
					<description>Determines whether an interrupt occurs when one or more Slave Select is asserted.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when any Slave Select transitions from deasserted to asserted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when any Slave Select transitions from deasserted to asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SSDEN</name>
					<description>Determines whether an interrupt occurs when all Slave Selects are deasserted.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INTERRUPT_WILL_BE</name>
							<description>No interrupt will be generated when all asserted Slave Selects transition to deasserted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AN_INTERRUPT_WILL_BE</name>
							<description>An interrupt will be generated when all asserted Slave Selects transition to deasserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>
			
