pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
				</field>
				<field>
					<name>FLEN</name>
					<description>Frame Length. Specifies the frame length from 1 to 16 bits. Note that frame lengths greater than 16 bits are supported by multiple sequential frames Note that if a 1-bit frame is selected, the master function will always insert a delay with a length of one SCK time following the single clock seen on the SCK pin. 0x0 = Data frame is 1 bit in length. 0x1 = Data frame is 1 bit in length. 0x2 = Data frame is 3 bits in length. ... 0xF = Data frame is 16 bits in length.</description>
					<bitRange>[27:24]</bitRange>
			
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:28]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>TXDAT</name>
			<description>SPI Transmit Data</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA</name>
					<description>Transmit Data. This field provides from 4 to 16 bits of data to be transmitted.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXCTL</name>
			<description>SPI Transmit Control</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>TX_SSEL</name>
					<description>Transmit Slave Select.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[19:17]</bitRange>
				</field>
				<field>
					<name>EOT</name>
					<description>End of Transfer.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EOF</name>
					<description>End of Frame.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>RXIGNORE</name>
					<description>Receive Ignore.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>FLEN</name>
					<description>Frame Length.</description>
					<bitRange>[27:24]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:28]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DIV</name>
			<description>SPI clock Divider</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIVVAL</name>
					<description>Rate divider value -1. Specifies how the PCLK for the SPI is divided to produce the SPI clock rate in master mode.  DIVVAL is -1 encoded such that the value 0 results in PCLK/1, the value 1 results in PCLK/2, etc. the maximum possible divide is for the value 0xFFFF, which results in PCLK/65536.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSTAT</name>
			<description>SPI Interrupt Status</description>
			<addressOffset>0x028</addressOffset>
			<access>read-only</access>
			<resetValue>0x02</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXRDY</name>
					<description>Receiver Ready flag.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXRDY</name>
					<description>Transmitter Ready flag.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXOV</name>
					<description>Receiver Overrun interrupt flag.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TXUR</name>
					<description>Transmitter Underrun interrupt flag.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SSA</name>
					<description>Slave Select Assert.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SSD</name>
					<description>Slave Select Deassert.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
		</peripheral>
		<peripheral derivedFrom="SPI0">
			<name>SPI1</name>
			<baseAddress>0x4005C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<value>1</value>
			</interrupt>
		</peripheral>


		
		<peripheral>
	<name>USART0</name>
	<description>USART</description>
	<groupName>USART</groupName>
	<baseAddress>0x40064000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>UART0</name>
	<value>3</value>
	</interrupt>
	<registers>						
	<register>					
		<name>CFG</name>				
		<description>USART Configuration register. Basic USART configuration settings that typically are not changed during operation.</description>				
		<addressOffset>0x000</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ENABLE</name>		
				<description>USART Enable.</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED_THE_USART_</name>
						<description>Disabled. The USART is disabled and the internal state machine and counters are reset. While Enable = 0, all USART interrupts  are disabled. When Enable is set again, CFG and most other control bits remain unchanged. For instance, when re-enabled, the USART will immediately generate a TxRdy interrupt if  enabled because the transmitter has been reset and is therefore available.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED_THE_USART_I</name>
						<description>Enabled. The USART is enabled for operation.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[1:1]</bitRange>		
					
