pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
			</field>			
			<field>			
				<name>DATALEN</name>		
				<description>Selects the data size for the USART.</description>		
				<bitRange>[3:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>7_BIT_DATA_LENGTH_</name>
						<description>7 bit Data length.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>8_BIT_DATA_LENGTH_</name>
						<description>8 bit Data length.</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>9_BIT_DATA_LENGTH_T</name>
						<description>9 bit data length. The 9th bit is commonly used for addressing in multidrop mode. See the ADDRDET bit in the CTRL register.</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED_</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>PARITYSEL</name>		
				<description>Selects what type of parity is used by the USART.</description>		
				<bitRange>[5:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_PARITY_</name>
						<description>No parity.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED_</name>
						<description>Reserved.</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>EVEN_PARITY_ADDS_A_</name>
						<description>Even parity. Adds a bit to each character such that the number of 1s in a transmitted character is even, and the number of 1s in a received character is expected to be even.</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ODD_PARITY_ADDS_A_B</name>
						<description>Odd parity. Adds a bit to each character such that the number of 1s in a transmitted character is odd, and the number of 1s in a received character is expected to be odd.</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>STOPLEN</name>		
				<description>Number of stop bits appended to transmitted data. Only a single stop bit is required for received data.</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>1_STOP_BIT_</name>
						<description>1 stop bit.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_STOP_BITS_THIS_SE</name>
						<description>2 stop bits. This setting should only be used for asynchronous communication.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Only write 0 to this bit.</description>		
				<bitRange>[7:7]</bitRange>		
					
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[8:8]</bitRange>		
					
			</field>			
			<field>			
				<name>CTSEN</name>		
				<description>CTS Enable. Determines whether CTS is used for flow control. CTS can be from the input pin, or from the USART's own RTS if loopback mode is enabled. See Section 16.7.3 for more information.</description>		
				<bitRange>[9:9]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_FLOW_CONTROL_THE</name>
						<description>No flow control. The transmitter does not receive any automatic flow control signal.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>FLOW_CONTROL_ENABLED</name>
						<description>Flow control enabled. The transmitter uses external or internal CTS for flow control purposes.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[10:10]</bitRange>		
					
			</field>			
			<field>			
				<name>SYNCEN</name>		
				<description>Selects synchronous or asynchronous operation.</description>		
				<bitRange>[11:11]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASYNCHRONOUS_MODE_IS</name>
						<description>Asynchronous mode is selected.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>SYNCHRONOUS_MODE_IS_</name>
						<description>Synchronous mode is selected.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>CLKPOL</name>		
				<description>Selects the clock polarity and sampling edge of received data in synchronous mode.</description>		
				<bitRange>[12:12]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>FALLING_EDGE_UN_RXD</name>
						<description>Falling edge. Un_RXD is sampled on the falling edge of SCLK.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RISING_EDGE_UN_RXD_</name>
						<description>Rising edge. Un_RXD is sampled on the rising edge of SCLK.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[13:13]</bitRange>		
					
			</field>			
			<field>			
				<name>SYNCMST</name>		
				<description>Synchronous mode Master select.</description>		
				<bitRange>[14:14]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>SLAVE_WHEN_SYNCHRON</name>
						<description>Slave. When synchronous mode is enabled, the USART is a slave.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>MASTER_WHEN_SYNCHRO</name>
						<description>Master. When synchronous mode is enabled, the USART is a master. In asynchronous mode, the baud rate clock will be output on SCLK if it is connected to a pin.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>LOOP</name>		
				<description>Selects data loopback mode.</description>		
				<bitRange>[15:15]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NORMAL_OPERATION_</name>
						<description>Normal operation.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LOOPBACK_MODE_THIS_</name>
						<description>Loopback mode. This provides a mechanism to perform diagnostic loopback testing for USART data. Serial data from the transmitter (Un_TXD) is connected internally to serial input of the receive (Un_RXD). Un_TXD and Un_RTS activity will also appear on external pins if these functions are configured to appear on device pins. The receiver RTS signal is also looped back to CTS and performs flow control if enabled by CTSEN.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[31:16]</bitRange>		
					
