pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:29]</bitRange>
				
				</field>
			</fields>
		</register>
		<register>
			<name>LIMIT</name>
			<description>SCT limit register</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LIMMSK_L</name>
					<description>If bit n is one, event n is used as a counter limit for the L or unified counter (event 0 = bit 0, event 1 = bit 1, event 5 = bit 5).</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:6]</bitRange>
				</field>
				<field>
					<name>LIMMSK_H</name>
					<description>If bit n is one, event n is used as a counter limit for the H counter (event 0 = bit 16, event 1 = bit 17, event 5 = bit 20).</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>HALT</name>
			<description>SCT halt condition register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>HALTMSK_L</name>
					<description>If bit n is one, event n sets the HALT_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 5 = bit 5).</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:6]</bitRange>
				</field>
				<field>
					<name>HALTMSK_H</name>
					<description>If bit n is one, event n sets the HALT_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 5 = bit 20).</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STOP</name>
			<description>SCT stop condition register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STOPMSK_L</name>
					<description>If bit n is one, event n sets the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 5 = bit 5).</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:6]</bitRange>
				</field>
				<field>
					<name>STOPMSK_H</name>
					<description>If bit n is one, event n sets the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 5 = bit 20).</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>START</name>
			<description>SCT start condition register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STARTMSK_L</name>
					<description>If bit n is one, event n clears the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 5 = bit 5).</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:6]</bitRange>
				</field>
				<field>
					<name>STARTMSK_H</name>
					<description>If bit n is one, event n clears the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 5 = bit 20).</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>COUNT</name>
			<description>SCT counter register</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_L</name>
					<description>When UNIFY = 0, read or write the 16-bit L counter value. When UNIFY = 1, read or write the lower 16 bits of the 32-bit unified counter.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>CTR_H</name>
					<description>When UNIFY = 0, read or write the 16-bit H counter value. When UNIFY = 1, read or write the upper 16 bits of the 32-bit unified counter.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STATE</name>
			<description>SCT state register</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATE_L</name>
					<description>State variable.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:5]</bitRange>
				</field>
				<field>
					<name>STATE_H</name>
					<description>State variable.</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INPUT</name>
			<description>SCT input register</description>
			<addressOffset>0x048</addressOffset>
			<access>read-only</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AIN0</name>
					<description>Real-time status of input 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>AIN1</name>
					<description>Real-time status of input 1.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AIN2</name>
					<description>Real-time status of input 2.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AIN3</name>
					<description>Real-time status of input 3.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:4]</bitRange>
				</field>
				<field>
					<name>SIN0</name>
					<description>Input 0 state synchronized to the SCT clock.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SIN1</name>
					<description>Input 1 state synchronized to the SCT clock.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>SIN2</name>
					<description>Input 2 state synchronized to the SCT clock.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>SIN3</name>
					<description>Input 3 state synchronized to the SCT clock.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>REGMODE</name>
			<description>SCT match/capture registers mode register</description>
			<addressOffset>0x04C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REGMOD_L</name>
					<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 4 = bit 4).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:5]</bitRange>
				</field>
				<field>
					<name>REGMOD_H</name>
					<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 4 = bit 19). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
					<bitRange>[19:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>OUTPUT</name>
			<description>SCT output register</description>
			<addressOffset>0x050</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>OUT</name>
					<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 3 = bit 3).</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>OUTPUTDIRCTRL</name>
			<description>SCT output counter direction control register</description>
			<addressOffset>0x054</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SETCLR0</name>
					<description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR1</name>
					<description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR2</name>
					<description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETCLR3</name>
					<description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SET_AND_CLEAR_DO_NOT</name>
							<description>Set and clear do not depend on any counter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_AND_CLEAR_ARE_RE</name>
							<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				
