pyocd/pyOCD/pyocd/debug/svd/data/LPC800_v0.3.svd
	</registers>
</peripheral>


		<peripheral>
			<name>GPIO_PORT</name>
			<description>General Purpose I/O port (GPIO)</description>
			<groupName>GPIO_PORT</groupName>
			<baseAddress>0xA0000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>18</dim>
					<dimIncrement>0x1</dimIncrement>
					<dimIndex>0-17</dimIndex>
					<name>B%s</name>
				
					<description>Byte pin registers port 0; pins PIO0_0 to PIO0_17</description>
					<addressOffset>0x0000</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PBYTE</name>
							<description>Read: state of the pin P0_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>18</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-17</dimIndex>
					<name>W%s</name>
					<description>Word pin registers port 0</description>
					<addressOffset>0x1000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PWORD</name>
							<description>Read 0: pin is LOW.  Write 0: clear output bit. Read 0xFFFF FFFF: pin is HIGH.  Write any value 0x0000 0001 to 0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read. Writing any value other than 0 will set the output bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DIR0</name>
					<description>Direction registers port 0</description>
					<addressOffset>0x2000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIRP0</name>
							<description>Selects pin direction for pin P0_n (bit 0 = P0_0, bit 1 = P0_1, ..., bit 17 = P0_17). 0 = input. 1 = output.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MASK0</name>
					<description>Mask register port 0</description>
					<addressOffset>0x2080</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MASKP0</name>
							<description>Controls which bits corresponding to P0_n are active in the P0MPORT register (bit 0 = P0_0, bit 1 = P0_1, ..., bit 17 = P0_17). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PIN0</name>
					<description>Port pin register port 0</description>
					<addressOffset>0x2100</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PORT0</name>
							<description>Reads pin states or loads output bits (bit 0 = P0_0, bit 1 = P0_1, ..., bit 17 = P0_17). 0 = Read: pin is low; write: clear output bit. 1 = Read: pin is high; write: set output bit.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MPIN0</name>
					<description>Masked port register port 0</description>
					<addressOffset>0x2180</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MPORTP0</name>
							<description>Masked port register (bit 0 = P0_0, bit 1 = P0_1, ..., bit 17 = P0_17). 0 = Read: pin is LOW and/or the corresponding bit in the MASK register is 1; write: clear output bit if the corresponding bit in the MASK register is 0. 1 = Read: pin is HIGH and the corresponding bit in the MASK register is 0; write: set output bit if the corresponding bit in the MASK register is 0.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SET0</name>
					<description>Write: Set register for port 0 Read: output bits for port 0</description>
					<addressOffset>0x2200</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETP0</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLR0</name>
					<description>Clear port 0</description>
					<addressOffset>0x2280</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLRP0</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>NOT0</name>
					<description>Toggle port 0</description>
					<addressOffset>0x2300</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>NOTP0</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
